# 06 - Combining datasets

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create the 3 DataFrames based on the following raw data

In [2]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### Step 3. Assign each to a variable called data1, data2, data3

In [9]:
data1 = pd.DataFrame.from_dict(raw_data_1)
data1

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [10]:
data2 = pd.DataFrame.from_dict(raw_data_2)
data2

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [11]:
data3 = pd.DataFrame.from_dict(raw_data_3)
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 4. Join the two dataframes along rows and assign all_data

In [16]:

result = pd.concat([data1, data2, data3], axis=1)
result

,subject_id,first_name,last_name,subject_id,first_name,last_name,subject_id,test_id
0,1,Alex,Anderson,4,Billy,Bonder,1,51
1,2,Amy,Ackerman,5,Brian,Black,2,15
2,3,Allen,Ali,6,Bran,Balwner,3,15
3,4,Alice,Aoni,7,Bryce,Brice,4,61
4,5,Ayoung,Atiches,8,Betty,Btisan,5,16
5,NaN,NaN,NaN,NaN,NaN,NaN,7,14
6,NaN,NaN,NaN,NaN,NaN,NaN,8,15
7,NaN,NaN,NaN,NaN,NaN,NaN,9,1
8,NaN,NaN,NaN,NaN,NaN,NaN,10,61
9,NaN,NaN,NaN,NaN,NaN,NaN,11,16

### Step 5. Join the two dataframes along columns and assing to all_data_col

In [17]:
rcolumns = pd.concat([data1, data2, data3], axis=0)
rcolumns

  subject_id first_name last_name  test_id
0          1       Alex  Anderson      NaN
1          2        Amy  Ackerman      NaN
2          3      Allen       Ali      NaN
3          4      Alice      Aoni      NaN
4          5     Ayoung   Atiches      NaN
0          4      Billy    Bonder      NaN
1          5      Brian     Black      NaN
2          6       Bran   Balwner      NaN
3          7      Bryce     Brice      NaN
4          8      Betty    Btisan      NaN
0          1        NaN       NaN     51.0
1          2        NaN       NaN     15.0
2          3        NaN       NaN     15.0
3          4        NaN       NaN     61.0
4          5        NaN       NaN     16.0
5          7        NaN       NaN     14.0
6          8        NaN       NaN     15.0
7          9        NaN       NaN      1.0
8         10        NaN       NaN     61.0
9         11        NaN       NaN     16.0

### Step 6. Print data3

In [18]:
print(data3)

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 7. Merge all_data and data3 along the subject_id value

In [32]:
pd.merge([right = data1, data2, data3], on="subjet_id")

SyntaxError: invalid syntax (<ipython-input-32-96d8f130db32>, line 1)

### Step 8. Merge only the data that has the same 'subject_id' on both data1 and data2

In [27]:
merge8  = pd.merge(data1, data2, data3, on="subject_id")

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

### Step 9. Merge all values in data1 and data2, with matching records from both sides where available.

In [30]:
merge9 = pd.concat([data1, data2], axis=0, join="inner")
merge9

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan